ryankurte/efm32-base/device/EFR32FG22/Include/efr32fg22a121f256gm40.h
/* GPIO Avalibility Info */
#define GPIO_PA_INDEX                              0U         /**< Index of port PA */
#define GPIO_PA_COUNT                              9U         /**< Number of pins on port PA */
#define GPIO_PA_MASK                               (0x01FFUL) /**< Port PA pin mask */
#define GPIO_PA_PIN0                               1U         /**< GPIO pin PA0 is present. */
#define GPIO_PA_PIN1                               1U         /**< GPIO pin PA1 is present. */
#define GPIO_PA_PIN2                               1U         /**< GPIO pin PA2 is present. */
#define GPIO_PA_PIN3                               1U         /**< GPIO pin PA3 is present. */
#define GPIO_PA_PIN4                               1U         /**< GPIO pin PA4 is present. */
#define GPIO_PA_PIN5                               1U         /**< GPIO pin PA5 is present. */
#define GPIO_PA_PIN6                               1U         /**< GPIO pin PA6 is present. */
#define GPIO_PA_PIN7                               1U         /**< GPIO pin PA7 is present. */
#define GPIO_PA_PIN8                               1U         /**< GPIO pin PA8 is present. */
#define GPIO_PB_INDEX                              1U         /**< Index of port PB */
#define GPIO_PB_COUNT                              5U         /**< Number of pins on port PB */
#define GPIO_PB_MASK                               (0x001FUL) /**< Port PB pin mask */
#define GPIO_PB_PIN0                               1U         /**< GPIO pin PB0 is present. */
#define GPIO_PB_PIN1                               1U         /**< GPIO pin PB1 is present. */
#define GPIO_PB_PIN2                               1U         /**< GPIO pin PB2 is present. */
#define GPIO_PB_PIN3                               1U         /**< GPIO pin PB3 is present. */
#define GPIO_PB_PIN4                               1U         /**< GPIO pin PB4 is present. */
#define GPIO_PC_INDEX                              2U         /**< Index of port PC */
#define GPIO_PC_COUNT                              8U         /**< Number of pins on port PC */
#define GPIO_PC_MASK                               (0x00FFUL) /**< Port PC pin mask */
#define GPIO_PC_PIN0                               1U         /**< GPIO pin PC0 is present. */
#define GPIO_PC_PIN1                               1U         /**< GPIO pin PC1 is present. */
#define GPIO_PC_PIN2                               1U         /**< GPIO pin PC2 is present. */
#define GPIO_PC_PIN3                               1U         /**< GPIO pin PC3 is present. */
#define GPIO_PC_PIN4                               1U         /**< GPIO pin PC4 is present. */
#define GPIO_PC_PIN5                               1U         /**< GPIO pin PC5 is present. */
#define GPIO_PC_PIN6                               1U         /**< GPIO pin PC6 is present. */
#define GPIO_PC_PIN7                               1U         /**< GPIO pin PC7 is present. */
#define GPIO_PD_INDEX                              3U         /**< Index of port PD */
#define GPIO_PD_COUNT                              4U         /**< Number of pins on port PD */
#define GPIO_PD_MASK                               (0x000FUL) /**< Port PD pin mask */
#define GPIO_PD_PIN0                               1U         /**< GPIO pin PD0 is present. */
#define GPIO_PD_PIN1                               1U         /**< GPIO pin PD1 is present. */
#define GPIO_PD_PIN2                               1U         /**< GPIO pin PD2 is present. */
#define GPIO_PD_PIN3                               1U         /**< GPIO pin PD3 is present. */

/* Fixed Resource Locations */
#define GPIO_SWCLK_PORT                            GPIO_PA_INDEX /**< Port of SWCLK.*/
#define GPIO_SWCLK_PIN                             1U            /**< Pin of SWCLK.*/
#define GPIO_SWDIO_PORT                            GPIO_PA_INDEX /**< Port of SWDIO.*/
#define GPIO_SWDIO_PIN                             2U            /**< Pin of SWDIO.*/
#define GPIO_SWV_PORT                              GPIO_PA_INDEX /**< Port of SWV.*/
#define GPIO_SWV_PIN                               3U            /**< Pin of SWV.*/
#define GPIO_TDI_PORT                              GPIO_PA_INDEX /**< Port of TDI.*/
#define GPIO_TDI_PIN                               4U            /**< Pin of TDI.*/
#define GPIO_TDO_PORT                              GPIO_PA_INDEX /**< Port of TDO.*/
#define GPIO_TDO_PIN                               3U            /**< Pin of TDO.*/
#define GPIO_TRACECLK_PORT                         GPIO_PA_INDEX /**< Port of TRACECLK.*/
#define GPIO_TRACECLK_PIN                          4U            /**< Pin of TRACECLK.*/
#define GPIO_TRACEDATA0_PORT                       GPIO_PA_INDEX /**< Port of TRACEDATA0.*/
#define GPIO_TRACEDATA0_PIN                        3U            /**< Pin of TRACEDATA0.*/
#define GPIO_EM4WU0_PORT                           GPIO_PA_INDEX /**< Port of EM4WU0.*/
#define GPIO_EM4WU0_PIN                            5U            /**< Pin of EM4WU0.*/
#define GPIO_EM4WU3_PORT                           GPIO_PB_INDEX /**< Port of EM4WU3.*/
#define GPIO_EM4WU3_PIN                            1U            /**< Pin of EM4WU3.*/
#define GPIO_EM4WU4_PORT                           GPIO_PB_INDEX /**< Port of EM4WU4.*/
#define GPIO_EM4WU4_PIN                            3U            /**< Pin of EM4WU4.*/
#define GPIO_EM4WU6_PORT                           GPIO_PC_INDEX /**< Port of EM4WU6.*/
#define GPIO_EM4WU6_PIN                            0U            /**< Pin of EM4WU6.*/
#define GPIO_EM4WU7_PORT                           GPIO_PC_INDEX /**< Port of EM4WU7.*/
#define GPIO_EM4WU7_PIN                            5U            /**< Pin of EM4WU7.*/
#define GPIO_EM4WU8_PORT                           GPIO_PC_INDEX /**< Port of EM4WU8.*/
#define GPIO_EM4WU8_PIN                            7U            /**< Pin of EM4WU8.*/
#define GPIO_EM4WU9_PORT                           GPIO_PD_INDEX /**< Port of EM4WU9.*/
#define GPIO_EM4WU9_PIN                            2U            /**< Pin of EM4WU9.*/
#define GPIO_THMSW_EN_PORT                         GPIO_PC_INDEX /**< Port of THMSW_EN.*/
#define GPIO_THMSW_EN_PIN                          0U            /**< Pin of THMSW_EN.*/
#define GPIO_THMSW_HALFSWITCH_PORT                 GPIO_PC_INDEX /**< Port of THMSW_HALFSWITCH.*/
#define GPIO_THMSW_HALFSWITCH_PIN                  0U            /**< Pin of THMSW_HALFSWITCH.*/
#define IADC0_VREFN_PORT                           GPIO_PB_INDEX /**< Port of VREFN.*/
#define IADC0_VREFN_PIN                            0U            /**< Pin of VREFN.*/
#define IADC0_VREFP_PORT                           GPIO_PA_INDEX /**< Port of VREFP.*/
#define IADC0_VREFP_PIN                            0U            /**< Pin of VREFP.*/
#define LFXO_LFXTAL_I_PORT                         GPIO_PD_INDEX /**< Port of LFXTAL_I.*/
#define LFXO_LFXTAL_I_PIN                          1U            /**< Pin of LFXTAL_I.*/
#define LFXO_LFXTAL_O_PORT                         GPIO_PD_INDEX /**< Port of LFXTAL_O.*/
#define LFXO_LFXTAL_O_PIN                          0U            /**< Pin of LFXTAL_O.*/
#define LFXO_LF_EXTCLK_PORT                        GPIO_PD_INDEX /**< Port of LF_EXTCLK.*/
#define LFXO_LF_EXTCLK_PIN                         1U            /**< Pin of LF_EXTCLK.*/

/* Part number capabilities */
#define AGC_PRESENT                                  /** AGC is available in this part */
#define AGC_COUNT                                  1 /** 1 AGCs available  */
#define AMUXCP_PRESENT                               /** AMUXCP is available in this part */
#define AMUXCP_COUNT                               1 /** 1 AMUXCPs available  */
#define BUFC_PRESENT                                 /** BUFC is available in this part */
#define BUFC_COUNT                                 1 /** 1 BUFCs available  */
#define BURAM_PRESENT                                /** BURAM is available in this part */
#define BURAM_COUNT                                1 /** 1 BURAMs available  */
#define BURTC_PRESENT                                /** BURTC is available in this part */
#define BURTC_COUNT                                1 /** 1 BURTCs available  */
#define CMU_PRESENT                                  /** CMU is available in this part */
#define CMU_COUNT                                  1 /** 1 CMUs available  */
#define CRYPTOACC_PRESENT                            /** CRYPTOACC is available in this part */
#define CRYPTOACC_COUNT                            1 /** 1 CRYPTOACCs available  */
#define DCDC_PRESENT                                 /** DCDC is available in this part */
#define DCDC_COUNT                                 1 /** 1 DCDCs available  */
#define DCI_PRESENT                                  /** DCI is available in this part */
#define DCI_COUNT                                  1 /** 1 DCIs available  */
#define DPLL_PRESENT                                 /** DPLL is available in this part */
#define DPLL_COUNT                                 1 /** 1 DPLLs available  */
#define EMU_PRESENT                                  /** EMU is available in this part */
#define EMU_COUNT                                  1 /** 1 EMUs available  */
#define EUART_PRESENT                                /** EUART is available in this part */
#define EUART_COUNT                                1 /** 1 EUARTs available  */
#define FRC_PRESENT                                  /** FRC is available in this part */
#define FRC_COUNT                                  1 /** 1 FRCs available  */
#define FSRCO_PRESENT                                /** FSRCO is available in this part */
#define FSRCO_COUNT                                1 /** 1 FSRCOs available  */
#define GPCRC_PRESENT                                /** GPCRC is available in this part */
#define GPCRC_COUNT                                1 /** 1 GPCRCs available  */
#define GPIO_PRESENT                                 /** GPIO is available in this part */
#define GPIO_COUNT                                 1 /** 1 GPIOs available  */
#define HFRCO_PRESENT                                /** HFRCO is available in this part */
#define HFRCO_COUNT                                1 /** 1 HFRCOs available  */
#define HFXO_PRESENT                                 /** HFXO is available in this part */
#define HFXO_COUNT                                 1 /** 1 HFXOs available  */
#define I2C_PRESENT                                  /** I2C is available in this part */
#define I2C_COUNT                                  2 /** 2 I2Cs available  */
#define IADC_PRESENT                                 /** IADC is available in this part */
#define IADC_COUNT                                 1 /** 1 IADCs available  */
#define ICACHE_PRESENT                               /** ICACHE is available in this part */
#define ICACHE_COUNT                               1 /** 1 ICACHEs available  */
#define LDMA_PRESENT                                 /** LDMA is available in this part */
#define LDMA_COUNT                                 1 /** 1 LDMAs available  */
#define LDMAXBAR_PRESENT                             /** LDMAXBAR is available in this part */
#define LDMAXBAR_COUNT                             1 /** 1 LDMAXBARs available  */
#define LETIMER_PRESENT                              /** LETIMER is available in this part */
#define LETIMER_COUNT                              1 /** 1 LETIMERs available  */
#define LFRCO_PRESENT                                /** LFRCO is available in this part */
#define LFRCO_COUNT                                1 /** 1 LFRCOs available  */
#define LFXO_PRESENT                                 /** LFXO is available in this part */
#define LFXO_COUNT                                 1 /** 1 LFXOs available  */
#define MODEM_PRESENT                                /** MODEM is available in this part */
#define MODEM_COUNT                                1 /** 1 MODEMs available  */
#define MSC_PRESENT                                  /** MSC is available in this part */
#define MSC_COUNT                                  1 /** 1 MSCs available  */
#define PDM_PRESENT                                  /** PDM is available in this part */
#define PDM_COUNT                                  1 /** 1 PDMs available  */
#define PROTIMER_PRESENT                             /** PROTIMER is available in this part */
#define PROTIMER_COUNT                             1 /** 1 PROTIMERs available  */
#define PRS_PRESENT                                  /** PRS is available in this part */
#define PRS_COUNT                                  1 /** 1 PRSs available  */
#define RAC_PRESENT                                  /** RAC is available in this part */
#define RAC_COUNT                                  1 /** 1 RACs available  */
#define RADIOAES_PRESENT                             /** RADIOAES is available in this part */
#define RADIOAES_COUNT                             1 /** 1 RADIOAESs available  */
#define RDMAILBOX_PRESENT                            /** RDMAILBOX is available in this part */
#define RDMAILBOX_COUNT                            2 /** 2 RDMAILBOXs available  */
#define RFCRC_PRESENT                                /** RFCRC is available in this part */
#define RFCRC_COUNT                                1 /** 1 RFCRCs available  */
#define RFSENSE_PRESENT                              /** RFSENSE is available in this part */
#define RFSENSE_COUNT                              1 /** 1 RFSENSEs available  */
#define ROOTCFG_PRESENT                              /** ROOTCFG is available in this part */
#define ROOTCFG_COUNT                              1 /** 1 ROOTCFGs available  */
#define RTCC_PRESENT                                 /** RTCC is available in this part */
#define RTCC_COUNT                                 1 /** 1 RTCCs available  */
#define SMU_PRESENT                                  /** SMU is available in this part */
#define SMU_COUNT                                  1 /** 1 SMUs available  */
#define SYNTH_PRESENT                                /** SYNTH is available in this part */
#define SYNTH_COUNT                                1 /** 1 SYNTHs available  */
#define SYSCFG_PRESENT                               /** SYSCFG is available in this part */
#define SYSCFG_COUNT                               1 /** 1 SYSCFGs available  */
#define TIMER_PRESENT                                /** TIMER is available in this part */
#define TIMER_COUNT                                5 /** 5 TIMERs available  */
#define ULFRCO_PRESENT                               /** ULFRCO is available in this part */
#define ULFRCO_COUNT                               1 /** 1 ULFRCOs available  */
#define USART_PRESENT                                /** USART is available in this part */
#define USART_COUNT                                2 /** 2 USARTs available  */
#define WDOG_PRESENT                                 /** WDOG is available in this part */
#define WDOG_COUNT                                 1 /** 1 WDOGs available  */
#define DEVINFO_PRESENT                              /** DEVINFO is available in this part */
#define DEVINFO_COUNT                              1 /** 1 DEVINFOs available  */

/* Include standard ARM headers for the core*/
#include "core_cm33.h"        /* Core Header File */
#include "system_efr32fg22.h" /* System Header File */

/** @} End of group EFR32FG22A121F256GM40_Part */

/**************************************************************************//**
 * @defgroup EFR32FG22A121F256GM40_Peripheral_TypeDefs EFR32FG22A121F256GM40 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 *****************************************************************************/
#include "efr32fg22_emu.h"
#include "efr32fg22_cmu.h"
#include "efr32fg22_hfxo.h"
#include "efr32fg22_hfrco.h"
#include "efr32fg22_fsrco.h"
#include "efr32fg22_dpll.h"
#include "efr32fg22_lfxo.h"
#include "efr32fg22_lfrco.h"
#include "efr32fg22_ulfrco.h"
#include "efr32fg22_msc.h"
#include "efr32fg22_icache.h"
#include "efr32fg22_prs.h"
#include "efr32fg22_gpio.h"
#include "efr32fg22_ldma.h"
#include "efr32fg22_ldmaxbar.h"
#include "efr32fg22_timer.h"
#include "efr32fg22_usart.h"
#include "efr32fg22_burtc.h"
#include "efr32fg22_i2c.h"
#include "efr32fg22_syscfg.h"
#include "efr32fg22_buram.h"
#include "efr32fg22_gpcrc.h"
#include "efr32fg22_dci.h"
#include "efr32fg22_rootcfg.h"
#include "efr32fg22_dcdc.h"
#include "efr32fg22_pdm.h"
#include "efr32fg22_rfsense.h"
#include "efr32fg22_aes.h"
#include "efr32fg22_smu.h"
#include "efr32fg22_rtcc.h"
#include "efr32fg22_letimer.h"
#include "efr32fg22_iadc.h"
#include "efr32fg22_wdog.h"
#include "efr32fg22_amuxcp.h"
#include "efr32fg22_eusart.h"
#include "efr32fg22_cryptoacc.h"
#include "efr32fg22_frc.h"
#include "efr32fg22_agc.h"
#include "efr32fg22_rfcrc.h"
#include "efr32fg22_modem.h"
#include "efr32fg22_synth.h"
#include "efr32fg22_protimer.h"
#include "efr32fg22_rac.h"
#include "efr32fg22_mailbox.h"
#include "efr32fg22_bufc.h"
#include "efr32fg22_devinfo.h"

/* Custom headers for LDMAXBAR and PRS mappings*/
#include "efr32fg22_prs_signals.h"
#include "efr32fg22_dma_descriptor.h"
#include "efr32fg22_ldmaxbar_defines.h"

/** @} End of group EFR32FG22A121F256GM40_Peripheral_TypeDefs  */

/**************************************************************************//**
 * @defgroup EFR32FG22A121F256GM40_Peripheral_Base EFR32FG22A121F256GM40 Peripheral Memory Map
 * @{
 *****************************************************************************/

